rfblue2/pic-disassembler/src/include/P16F727.INC
_BORV_25             EQU  H'3BFF'    ; Brown-out Reset Voltage (VBOR) set to 2.5 V nominal
_BORV_2_5            EQU  H'3BFF'    ; Brown-out Reset Voltage (VBOR) set to 2.5 V nominal
_BORV_19             EQU  H'3FFF'    ; Brown-out Reset Voltage (VBOR) set to 1.9 V nominal
_BORV_1_9            EQU  H'3FFF'    ; Brown-out Reset Voltage (VBOR) set to 1.9 V nominal

_PLLEN_OFF           EQU  H'2FFF'    ; INTOSC Frequency is 500 kHz
_PLL_DIS             EQU  H'2FFF'    ; INTOSC Frequency is 500 kHz
_PLLEN_ON            EQU  H'3FFF'    ; INTOSC Frequency is 16MHz (32x)
_PLL_EN              EQU  H'3FFF'    ; INTOSC Frequency is 16MHz (32x)

_DEBUG_ON            EQU  H'1FFF'    ; In-Circuit Debugger enabled, RB6/ICSPCLK and RB7/ICSPDAT are dedicated to the debugger
_DEBUG_OFF           EQU  H'3FFF'    ; In-Circuit Debugger disabled, RB6/ICSPCLK and RB7/ICSPDAT are general purpose I/O pins

;----- CONFIG2 Options --------------------------------------------------
_VCAPEN_RA0          EQU  H'3FCF'    ; VCAP functionality is enabled on RA0
_VCAP_RA0            EQU  H'3FCF'    ; VCAP functionality is enabled on RA0
_VCAPEN_RA5          EQU  H'3FDF'    ; VCAP functionality is enabled on RA5
_VCAP_RA5            EQU  H'3FDF'    ; VCAP functionality is enabled on RA5
_VCAPEN_RA6          EQU  H'3FEF'    ; VCAP functionality is enabled on RA6
_VCAP_RA6            EQU  H'3FEF'    ; VCAP functionality is enabled on RA6
_VCAPEN_DIS          EQU  H'3FFF'    ; All VCAP pin functions are disabled
_VCAP_DIS            EQU  H'3FFF'    ; All VCAP pin functions are disabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'2006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'2000'
_IDLOC1          EQU  H'2001'
_IDLOC2          EQU  H'2002'
_IDLOC3          EQU  H'2003'

        LIST
